#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lucky3028/Kagerou/runs/run-JpH2bgTUTUEvKL44

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # discord_category_channel.announce will be created
  + resource "discord_category_channel" "announce" {
      + id        = (known after apply)
      + name      = "announcement"
      + position  = 1
      + server_id = (known after apply)
      + type      = "category"
    }

  # discord_category_channel.general will be created
  + resource "discord_category_channel" "general" {
      + id        = (known after apply)
      + name      = "general"
      + position  = 0
      + server_id = (known after apply)
      + type      = "category"
    }

  # discord_member_roles.admin["255951609174032385"] will be created
  + resource "discord_member_roles" "admin" {
      + id        = (known after apply)
      + server_id = (known after apply)
      + user_id   = "255951609174032385"

      + role {
          + has_role = true
          + role_id  = (known after apply)
        }
    }

  # discord_member_roles.admin["933006368443604992"] will be created
  + resource "discord_member_roles" "admin" {
      + id        = (known after apply)
      + server_id = (known after apply)
      + user_id   = "933006368443604992"

      + role {
          + has_role = true
          + role_id  = (known after apply)
        }
    }

  # discord_role.admin will be created
  + resource "discord_role" "admin" {
      + hoist       = false
      + id          = (known after apply)
      + managed     = (known after apply)
      + mentionable = false
      + name        = "管理用ロール"
      + permissions = 8
      + position    = 0
      + server_id   = (known after apply)
    }

  # discord_server.server will be created
  + resource "discord_server" "server" {
      + afk_timeout                   = 300
      + default_message_notifications = 1
      + explicit_content_filter       = 0
      + icon_hash                     = (known after apply)
      + id                            = (known after apply)
      + name                          = "Kagerou"
      + owner_id                      = "933006368443604992"
      + region                        = "japan"
      + server_id                     = (known after apply)
      + splash_hash                   = (known after apply)
      + verification_level            = 0
    }

  # discord_text_channel.general will be created
  + resource "discord_text_channel" "general" {
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "general"
      + nsfw                     = false
      + position                 = 1
      + server_id                = (known after apply)
      + sync_perms_with_category = true
      + type                     = "text"
    }

  # discord_text_channel.news will be created
  + resource "discord_text_channel" "news" {
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "news"
      + nsfw                     = false
      + position                 = 1
      + server_id                = (known after apply)
      + sync_perms_with_category = true
      + type                     = "text"
    }

  # discord_text_channel.rule will be created
  + resource "discord_text_channel" "rule" {
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "rule"
      + nsfw                     = false
      + position                 = 1
      + server_id                = (known after apply)
      + sync_perms_with_category = true
      + type                     = "text"
    }

Plan: 9 to add, 0 to change, 0 to destroy.


```

</details>